app/controllers/client/orders_controller.rb

SELECT * FROM `clients` WHERE (`clients`.`user_id` = 33058) LIMIT 1
SELECT * FROM `clients` WHERE (`clients`.`id` = 1169)
SELECT * FROM `orders` WHERE (client_id = 1169 AND admin_approve IS NULL AND status != 'closed' AND (status_timeline = 'Notary Assigned' AND status_timeline != 'Time/Date Signing Set' AND status != 'Refuse To Sign') ) ORDER BY created_at DESC
SELECT * FROM `users` WHERE (`users`.`id` = 33058) LIMIT 1
---
  def index
    @client = Client.find_by_user_id(self.current_user.id)
   sort_by = {
        "Signer Name" => "borrower_1_last_name ASC",
        "Appointment Scheduled" => "signing_date ASC",
        "NF #" => "loan_number ASC",
        "Order Opened" => "created_at DESC",
    }
    per_page = 20
    @filter = sort_by[params[:filter]] rescue nil
    @filter ||= "created_at DESC"

    @orders = Order.find(:all, :conditions => ["client_id = ? AND admin_approve IS NULL AND cancel_order_date IS NULL and status != 'closed'", @client.id], :order => @filter).paginate :page => params[:page], :per_page => per_page

SELECT * FROM `clients` WHERE (`clients`.`user_id` = 33054) LIMIT 1
SELECT * FROM `orders` WHERE (client_id = 1168 AND admin_approve IS NULL AND status != 'closed' AND (status_timeline = 'Notary Paid in Full' ) ) ORDER BY created_at DESC
SELECT * FROM `users` WHERE (`users`.`id` = 33054) LIMIT 1
SELECT * FROM `notaries` WHERE (`notaries`.`user_id` = 33054) LIMIT 1
---
  def history
    @client = Client.find_by_user_id(self.current_user.id)
     sort_by = {
        "Signer Name" => "borrower_1_last_name ASC",
        "Appointment Scheduled" => "signing_date ASC",
        "NF #" => "loan_number ASC",
        "Order Opened" => "created_at DESC",
    }
    per_page = 20
    @filter = sort_by[params[:filter]] rescue nil
    @filter ||= "created_at DESC"

    @orders = Order.find(:all, :conditions => ["client_id = ? AND admin_approve = ?", @client.id, 1], :order => @filter).paginate :page => params[:page], :per_page => per_page
    @refused_to_sign_orders = Order.find(:all, :conditions => ["client_id = ? AND admin_approve IS NULL AND status != 'closed' AND (status = ? ) ", @client.id, "Refuse To Sign"], :order => @filter).paginate :page => params[:page], :per_page => per_page
    @paid_orders = Order.find(:all, :conditions => ["client_id = ? AND admin_approve IS NULL AND status != 'closed' AND (status_timeline = ? ) ", @client.id, "Notary Paid in Full" ], :order => @filter).paginate :page => params[:page], :per_page => per_page

SELECT * FROM `orders` WHERE (feedback = 'needed' AND status = 'closed' AND client_id = 33054 )
SELECT * FROM `notaries` WHERE (`notaries`.`id` = 32800)
SELECT * FROM `clients` WHERE (`clients`.`id` = 1168)
SELECT * FROM `agents` WHERE (`agents`.`id` = 24) LIMIT 1
---
  def order_detail
    @order = Order.find(params[:order_id])
    if @order.notary_id
      @notary = Notary.find(@order.notary_id)
    end

    if @order.client_id
      @client = @clientdd = Client.find(@order.client_id)
    end

    if @order.agent_id
      @agent = Agent.find_by_id(@order.agent_id)

SELECT * FROM `orders` WHERE (feedback = 'needed' AND status = 'closed' AND client_id = 33054 )
SELECT * FROM `notaries` WHERE (`notaries`.`id` IS NULL) LIMIT 1
---
  def find_notary
    @order = Order.find(params[:id])
    @miles = 10
    @dropdown_language = "display:none;"
    @check_additional_language = ""
    @check_attorney = ""
    @check_title_producer = ""
    @check_email_capable = ""
    @check_reverse_mortgage = ""
    @check_life_settlement = ""
    @check_enotification = ""
    @selected_lang = ""
    @query_str = ""
    #  Notary.distance_between(from, to)
    unless params[:notary_search]
      @notaries = Notary.find(:all, :origin => @order.signing_location_zip_code, :within => @miles, :conditions => "on_vacation IS NOT true", :order => "distance asc")

UPDATE `orders` SET `cancel_order` = 'Cancel the order by client.', `updated_at` = '2015-02-24 15:54:10' WHERE `id` = 1295
SELECT * FROM `clients` WHERE (`clients`.`id` = 1168) LIMIT 1
SELECT * FROM `agents` WHERE (`agents`.`id` = 24) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 33054) LIMIT 1
---
  def cancel_order

    @order = Order.find_by_id(params[:orderid])
    @order.update_attribute(:cancel_order, params[:cancel_order])
    @order.update_attribute(:cancel_order_date, Date.today)

    @order.save
    if !@order.cancel_order.blank?
      client = Client.find_by_id(@order.client_id)
      notary = Notary.find_by_id(@order.notary_id)
      agent = Agent.find(@order.agent_id).email if !@order.agent_id.blank?
      notary_email = User.find(notary.user_id).email if !notary.blank?