app/controllers/admin/clients_controller.rb

SELECT * FROM `orders` WHERE (`orders`.`client_id` = 1000)
SELECT `clients`.* FROM `clients` INNER JOIN users ON users.id = clients.user_id WHERE (user_type='client') ORDER BY clients.id ASC LIMIT 0, 40
SELECT count(*) AS count_all FROM `clients` INNER JOIN users ON users.id = clients.user_id WHERE (user_type='client')
---
  def index
		if params[:msg].present?
						@notice_msg=params[:msg]
		end
    if session[:admin_user] == nil
      redirect_to session[:url]
    end

    if params[:order]!=nil
           @order = "clients."+params[:sortby]+" "+params[:order]
    else
      @order = "clients.id ASC"
    end
    if params[:keyword]!=nil
        @clients = Client.paginate :page => params[:page], :joins => "INNER JOIN users ON users.id = clients.user_id",:conditions=>["user_type='client' AND client_name like ?",'%'+params[:keyword]+'%'], :order => @order

SELECT * FROM `promocodes` WHERE (`promocodes`.`id` = 1) LIMIT 1
---
    def promocode

      if request.post?
        Promocode.update(1,:promocode=> params[:promo]['promo'],:credits=> params[:credits]['credits'])
      end
      @promocode = Promocode.find_by_id(1)

SELECT * FROM `admins` WHERE (`admins`.`id` = 1) LIMIT 1
---
    def settings
            if request.post?
        Admin.update(1,:username=> params[:admin]['username'],:password=> params[:admin]['password'])
      end
      @admin = Admin.find_by_id(1)

SELECT * FROM `clients` WHERE (`clients`.`id` = 1000)
SELECT * FROM `client_executives` WHERE (`client_executives`.client_id = 1000)
SELECT * FROM `executives`
---
	def assign_executive
					# getting associated client
					@client=Client.find(params[:client_id])
					# getting the client executives mapping details
					@client_executive=@client.client_executives.present? ? @client.client_executives.first : nil

SELECT * FROM `clients` WHERE (`clients`.`id` = 1000)
SELECT * FROM `client_executives` WHERE (`client_executives`.client_id = 1000)
INSERT INTO `client_executives` (`share_value`, `client_id`, `executive_id`, `share_percentage`) VALUES(100, 1000, 1, NULL)
---
	def update_executive
					# removing blank strings
					params[:client][:executives].reject! {|e| e.blank? }
					flash[:errors]=[]
					@client=Client.find(params[:client][:id])
					# validating parameters
					if params[:client][:executives].blank?
									flash[:errors].push("Please select atleast one executive")
					end
					if params[:client][:percentage].blank? and params[:client][:amount].blank?
									flash[:errors].push("Please provide either static amount or amount percentage")
					end
					if params[:client][:percentage].present? and !params[:client][:percentage].match(/[0-9.]+/)
									flash[:errors].push("Share percentage should be numeric or float")
					end
					if params[:client][:percentage].present? and params[:client][:percentage].to_i > 100
									flash[:errors].push("Share percentage should be within 100")
					end
					if params[:client][:amount].present? and !params[:client][:amount].match(/[0-9]+/)
									flash[:errors].push("Static amount should be numeric")
					end
					if flash[:errors].present?
									render :assign_executive
					else
									count=0
									# removing all old client executive records for client
									if @client.client_executives.present? and params[:client][:executives].map(&:to_i)!=@client.client_executives.map(&:executive_id)
													@client.client_executives.delete_all
													# need to create new client executive records in database by mapping executive and client
													params[:client][:executives].each{|e|
																	ce=ClientExecutive.create(:client_id => @client.id, :executive_id => e, :share_percentage => params[:client][:percentage], :share_value => params[:client][:amount])