app/controllers/admin/executives_controller.rb

  def index
    if session[:admin_user] == nil
      redirect_to session[:url]
    end
    if params[:keyword]!=nil
      @executives = Executive.paginate :page => params[:page], :order => 'id ASC',:conditions=>["name like ? or address like ? or city like ? or state like ?",'%'+params[:keyword]+'%','%'+params[:keyword]+'%','%'+params[:keyword]+'%','%'+params[:keyword]+'%']
---
SELECT * FROM `executives` WHERE (name like '%%' or address like '%%' or city like '%%' or state like '%%') ORDER BY id ASC LIMIT 0, 10