app/controllers/admin/orders_controller.rb

  def index
    if session[:admin_user] == nil
      redirect_to session[:url]
    end
    # @orders = Order.find(:all,:conditions=>["status='closed'"])
    #@orders = Order.paginate :page => params[:page], :conditions => ["status='closed'"]
    if params[:per_page] == "All"
      #@orders = Order.find(:all,:conditions=>["status='closed' AND admin_order_cancel IS NULL AND move_to_order_history_by_admin = false"])
      @orders = Order.find(:all,:conditions=>["(status_timeline='Order Completed' or (status_timeline='Notary Paid in Full' and payment = false ) or (status_timeline='Executive Paid in Full' and executive_payment = true )) AND admin_order_cancel IS NULL AND move_to_order_history_by_admin = false and payment = false"], :order => 'updated_at desc')
    else
      #@orders = Order.find(:all,:conditions=>["status='closed' AND admin_order_cancel IS NULL AND move_to_order_history_by_admin = false"]).paginate(:page => params[:page], :per_page => params[:per_page] || 25)
      @orders = Order.find(:all,:conditions=>["(status_timeline='Order Completed' or (status_timeline='Notary Paid in Full' and notary_payment = true ) or (status_timeline='Executive Paid in Full' and executive_payment = true )) AND admin_order_cancel IS NULL AND move_to_order_history_by_admin = false and payment = false"], :order => 'updated_at desc').paginate(:page => params[:page], :per_page => params[:per_page] || 25)
    end
    @feedback_average=[]
    @orders.each do |f|
      @feedback=OrderFeedback.find_all_by_order_id(f.id)
---
SELECT * FROM `notaries` WHERE (`notaries`.`id` = 31949)
SELECT * FROM `orders` WHERE (`orders`.`id` = 1004) LIMIT 1
SELECT * FROM `orders` WHERE (status='closed') LIMIT 0, 10
SELECT count(*) AS count_all FROM `orders` WHERE (status='closed')
SELECT * FROM `order_feedbacks` WHERE (`order_feedbacks`.order_id = 1005) LIMIT 1

  def open_order
    redirect_to session[:url] if session[:admin_user] == nil

    @orders = Order.find(:all, :conditions => ["status!='closed' AND admin_order_cancel IS NULL AND move_to_order_history_by_admin = false"], :order => "updated_at DESC")
    @awaiting_notary_orders = []
    @notary_assigned_orders = []
    @appt_confirmed_orders  = []
    @attention_orders       = []
    @refuse_to_sign_orders  = []
    @signed_orders_orders   = []
    @paid_orders            = []
    @completed_orders       = []

    @orders.each do |order|
      @awaiting_notary_orders << order if order.status == "need notary" && order.move_to_order_history_by_admin == false
      @notary_assigned_orders << order if order.status == "filled" && order.status_timeline == "Notary Assigned" && order.move_to_order_history_by_admin == false
      @appt_confirmed_orders  << order if order.status != "Refuse To Sign" && order.status_timeline == "Time/Date Signing Set" && order.notary_id.present? && order.move_to_order_history_by_admin == false
      #@attention_orders       << order if order.status != "Refuse To Sign" && order.status_timeline == "Documents Received by Notary" && order.notary_id.present?
      #@refuse_to_sign_orders  << order if order.status == "Refuse To Sign" && order.notary_id.present?
      @signed_orders_orders   << order if ["signing_completed", "Signing Completed"].include?(order.status_timeline) && order.notary_id.present? && order.move_to_order_history_by_admin == false
      @completed_orders       << order if ["Order Completed"].include?(order.status_timeline) && order.notary_id.present? && order.move_to_order_history_by_admin == false
      @paid_orders            << order if ['Paid', 'Notary Paid in Full', 'Executive Paid in Full'].include?(order.status_timeline) && order.notary_id.present? && order.move_to_order_history_by_admin == false && order.payment == true
    end

      #attention_orders = Order.find_by_sql("select o.id as order_id from orders o LEFT JOIN messages m ON o.id=m.order_id LEFT JOIN notes n ON o.id=n.order_id where o.status != 'Refuse To Sign' AND o.status_timeline ='Documents Received by Notary' AND move_to_order_history_by_admin=false AND n.require_attention = true and o.notary_id IS NOT NULL")
      attention_orders = Order.find_by_sql("select o.id as order_id from orders o LEFT JOIN messages m ON o.id=m.order_id LEFT JOIN notes n ON o.id=n.order_id where move_to_order_history_by_admin=false AND n.require_attention = true and o.notary_id IS NOT NULL")
      attention_orders.each do |order|
        @attention_orders << Order.find(order.order_id)
---
SELECT * FROM `orders` WHERE (status!='closed') ORDER BY updated_at DESC
SELECT * FROM `notaries` WHERE (`notaries`.`id` = 32800)

    @appt_confirmed_orders  = @appt_confirmed_orders.paginate :page => params[:page], :per_page => per_page
    @attention_orders       = @attention_orders.paginate :page => params[:page], :per_page => per_page
    #@refuse_to_sign_orders  = @refuse_to_sign_orders.paginate :page => params[:page], :per_page => per_page
    @refuse_to_sign_orders  = Order.paginate :page => params[:page], :per_page => per_page, :conditions => ["(cancel_order IS NOT NULL  or admin_order_cancel IS NOT NULL ) AND move_to_order_history_by_admin=false"], :order => "updated_at DESC"
---
SELECT * FROM `orders` WHERE (cancel_order IS NOT NULL AND move_to_order_history_by_admin=false) ORDER BY updated_at DESC LIMIT 0, 20

  def pending_order
    @ex=[]
    if session[:admin_user] == nil
      redirect_to session[:url]
    end

    @orders = Order.paginate :page => params[:page], :conditions => ["status!='filled'AND status!='closed'"]
---
SELECT * FROM `orders` WHERE (status!='filled'AND status!='closed') LIMIT 0, 10
SELECT count(*) AS count_all FROM `orders` WHERE (status!='filled'AND status!='closed')

   def order_history_paid
    if session[:admin_user] == nil
      redirect_to session[:url]
    end
    paid_orders            = []
    per_page = 20
    @orders = Order.find(:all, :conditions => ["status!='closed'"], :order => "updated_at DESC").paginate :page => params[:page], :per_page => per_page
---
SELECT * FROM `orders` WHERE (status!='closed') ORDER BY updated_at DESC

   def order_history_cancelled
    if session[:admin_user] == nil
      redirect_to session[:url]
    end
    per_page = 20
    @history_cancelled_orders= Order.paginate :page => params[:page], :conditions => ["cancel_order IS NOT NULL AND move_to_order_history_by_admin=true"]
---
SELECT * FROM `orders` WHERE (cancel_order IS NOT NULL AND move_to_order_history_by_admin=true) LIMIT 0, 10

  def cancelled_order
    if session[:admin_user] == nil
      redirect_to session[:url]
    end
    @orders = Order.paginate :page => params[:page], :conditions => ["cancel_order IS NOT NULL"]
---
SELECT * FROM `orders` WHERE (cancel_order IS NOT NULL) LIMIT 0, 10
SELECT count(*) AS count_all FROM `orders` WHERE (cancel_order IS NOT NULL)

  def approve_to_cancel_message
#    if session[:admin_user] == nil
#      redirect_to session[:url]
#    end

    @order = Order.find_by_id(params[:orderid])

    @order.update_attribute(:admin_order_cancel, params[:admin_order_cancel])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = '1331') LIMIT 1
UPDATE `orders` SET `admin_order_cancel` = 'This is for testing', `updated_at` = '2015-02-24 15:25:31' WHERE `id` = 1331

  def approve_to_cancel
    @order=Order.find_by_id(params[:id])
    @user_client=Client.find_by_id(@order.client_id).user
    #raise params[:id].inspect                    # 0 notes approved pending
    if params[:approve]=='1'
      @order.update_attribute(:admin_approve, 1) #approved yes
---
SELECT * FROM `orders` WHERE (`orders`.`id` = '1295') LIMIT 1
SELECT * FROM `clients` WHERE (`clients`.`id` = 1168) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 33054)
UPDATE `orders` SET `travel_fee` = 50.0, `updated_at` = '2015-02-25 07:50:25' WHERE `id` = 1295

  def edit_travel_fee

    @orders=Order.find(params[:order_id])
    @orders.update_attribute(:travel_fee, params[:travel_fee].to_f)
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1053)
UPDATE `orders` SET `travel_fee` = 35.0, `updated_at` = '2015-02-25 06:21:03' WHERE `id` = 1053

  def order_history_accounting
    if session[:admin_user] == nil
      redirect_to session[:url]
    end
    @orders = Order.paginate :page => params[:page], :conditions => ["status!='closed'"]
---
SELECT * FROM `orders` WHERE (status!='closed') LIMIT 0, 10
SELECT count(*) AS count_all FROM `orders` WHERE (status!='closed')

  def find_notary
    @order = Order.find(params[:id], :conditions => ["status = ?", "need notary"])
    @miles = 10
    @dropdown_language = "display:none;"
    @check_additional_language = ""
    @check_attorney = ""
    @check_title_producer = ""
    @check_email_capable = ""
    @check_reverse_mortgage = ""
    @check_life_settlement = ""
    @check_enotification = ""
    @selected_lang = ""
    @query_str = ""

    #  Notary.distance_between(from, to)
    unless params[:notary_search]
      @notaries = Notary.find(:all, :origin => @order.signing_location_zip_code, :within => @miles, :conditions => "on_vacation IS NOT true",:order=>"distance asc" )
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1023) LIMIT 1
SELECT * FROM `notaries` WHERE (`notaries`.`id` = 32800)

    end

    @multiple_notary=[]
    MultipleNotary.find_all_by_order_id(@order.id).each do |f|
---
SELECT * FROM `multiple_notaries` WHERE (`multiple_notaries`.`order_id` = 1023)

  def order_detail
    @order = Order.find(params[:order_id])
    @order_feedback = OrderFeedback.find(:all, :conditions => ["order_id = ?", @order.id]).first

    # find whether the order detail page fetched from Attention tab ( tabs5 )
    if params[:tab] == 'tabs5'
												@notes=Notes.find_all_by_order_id(params[:order_id])
---
SELECT * FROM `order_feedbacks` WHERE (order_id = 1330)
SELECT * FROM `notes` WHERE (user_id is null AND order_id = 1330) ORDER BY created_at DESC

  def edit
    @order = Order.find(params[:id])
    @notary = @order.notary
    @client = Client.find_by_user_id(@notary.user_id) if @notary
---
SELECT * FROM `clients` WHERE (`clients`.`user_id` = 33074) LIMIT 1