app/controllers/notary/feedback_controller.rb

  def index
    @notary = Notary.find_by_user_id(self.current_user.id)
    @order_feedbacks = OrderFeedback.find(:all, :conditions => ["notary_id = ?", @notary.id])
---
SELECT * FROM `notaries` WHERE (`notaries`.`user_id` = 33055) LIMIT 1
SELECT * FROM `order_feedbacks` WHERE (`order_feedbacks`.`notary_id` = 32793)
SELECT * FROM `users` WHERE (`users`.`id` = 33055) LIMIT 1