app/controllers/notary/messages_controller.rb

  def index
    if params[:id].nil?
      @messages = Message.find(:all, :conditions => ["recipient_id = ?", self.current_user.id], :order => "created_at DESC")
---
SELECT * FROM `messages` WHERE (recipient_id = 33055) ORDER BY created_at DESC
SELECT * FROM `orders` WHERE (feedback = 'needed' AND status = 'closed' AND client_id = 33055 )
SELECT * FROM `users` WHERE (`users`.`id` = 33055) LIMIT 1

  def sent
    @messages = Message.find(:all, :conditions => ["user_id = ? AND hide_from_sender IS NOT true", self.current_user.id], :order => "created_at DESC")
---
SELECT * FROM `messages` WHERE (user_id = 33055 AND hide_from_sender IS NOT true) ORDER BY created_at DESC
SELECT * FROM `orders` WHERE (feedback = 'needed' AND status = 'closed' AND client_id = 33055 )
SELECT * FROM `users` WHERE (`users`.`id` = 33055) LIMIT 1