app/controllers/notary/orders_controller.rb

  def index
    @notary = Notary.find_by_user_id(self.current_user.id)
    sort_by = {
        "Signer Name" => "borrower_1_last_name ASC",
        "Appointment Scheduled" => "signing_date ASC",
        "NF #" => "loan_number ASC",
        "Order Opened" => "created_at DESC",
    }
    @filter = sort_by[params[:filter]] rescue nil
    @filter ||= "created_at DESC"
    #@multiple_notary = MultipleNotary.find_all_by_notary_id(@notary,:conditions => ["status ='not filled'"]).collect{|i|i.order_id}
    #@orders = Order.find(:all, :conditions => ["(id IN (?) AND status = 'need notary') OR (notary_id = ? AND status = 'filled') OR (notary_id = ? AND status = 'Refuse To Sign')", @multiple_notary, @notary.id, @notary.id ], :order => @filter)
    notary = Notary.find_by_user_id(current_user.id)
    @orders = Order.find(:all, :conditions => ["status!=? AND notary_id=?", 'closed', notary.id], :order => @filter)
---
SELECT * FROM `notaries` WHERE (`notaries`.`user_id` = 33055) LIMIT 1
SELECT * FROM `orders` WHERE (feedback = 'needed' AND status = 'closed' AND client_id = 33055 )
SELECT * FROM `users` WHERE (`users`.`id` = 33055) LIMIT 1

   def pending_orders
     @notary = Notary.find_by_user_id(self.current_user.id)
     multiple_notary = MultipleNotary.find_all_by_notary_id(@notary,:conditions => ["status ='not filled'"]).collect{|i|i.order_id}

    if params[:notification]
      @multi_notary=MultipleNotary.find_by_notary_id_and_order_id(params[:notary_id],params[:order_id])
      @multi_notary.notification=1
      @multi_notary.save
    end

     sort_by = {
         "Borrower Name" => "borrower_1_last_name ASC",
         "Signing Date" => "signing_date ASC",
         "Escrow Number" => "loan_number ASC",
         "Date Created" => "created_at DESC",
     }

     @filter = sort_by[params[:filter]] rescue nil
     @filter ||= "borrower_1_last_name ASC"

     @orders = Order.find(:all, :conditions => ["id IN (?) AND status = 'need notary'", multiple_notary ], :order => @filter)
---
SELECT * FROM `notaries` WHERE (`notaries`.`user_id` = 33055) LIMIT 1
SELECT * FROM `multiple_notaries` WHERE (`multiple_notaries`.`notary_id` = 32793 AND `multiple_notaries`.`order_id` = 1310) LIMIT 1
SELECT * FROM `orders` WHERE (status = 'closed') AND (`orders`.`notary_id` = 32793)
SELECT * FROM `orders` WHERE (id IN (1257,1258,1259,1260,1264,1265,1266,1269,1270,1271,1272,1273,1274,1275,1276,1277,1278,1279,1283,1284,1287,1296,1310) AND status = 'need notary') ORDER BY borrower_1_last_name ASC

  def history
    @notary = Notary.find_by_user_id(self.current_user.id)
    sort_by = {
        "Borrower Name" => "borrower_1_last_name ASC",
        "Signing Date" => "signing_date ASC",
        "Escrow Number" => "loan_number ASC",
        "Date Created" => "created_at DESC",
    }
    per_page = 20
    filter = sort_by[params[:filter]] rescue nil
    filter ||= "borrower_1_last_name ASC"
    @orders = Order.find(:all, :conditions => ["status!=? AND notary_id=?", 'closed', @notary.id], :order => filter)
---
SELECT * FROM `notaries` WHERE (`notaries`.`user_id` = 33055) LIMIT 1
SELECT * FROM `orders` WHERE (notary_id = 32793 AND status = 'closed') ORDER BY borrower_1_last_name ASC
SELECT * FROM `users` WHERE (`users`.`id` = 33055) LIMIT 1

  def order_detail
    @order = Order.find(params[:order_id])
    @client = Client.find(@order.client_id)

    if @order.notary_id
      @notary = Notary.find(@order.notary_id)
    end

    if @order.agent_id
      @agent = Agent.find_by_id(@order.agent_id)
---
SELECT * FROM `orders` WHERE (feedback = 'needed' AND status = 'closed' AND client_id = 33055 )
SELECT * FROM `clients` WHERE (`clients`.`id` = 1151)
SELECT * FROM `notaries` WHERE (`notaries`.`id` = 31949)
SELECT * FROM `agents` WHERE (`agents`.`id` = 17) LIMIT 1