app/controllers/notary/profile_controller.rb

SELECT * FROM `notaries` WHERE (`notaries`.`user_id` = 33055) LIMIT 1
---
  def index
    @notary = Notary.find_by_user_id(self.current_user.id)

SELECT * FROM `notaries` WHERE (`notaries`.`user_id` = 33055) LIMIT 1
---
  def address
    @notary = Notary.find_by_user_id(self.current_user.id)

SELECT * FROM `notaries` WHERE (`notaries`.`user_id` = 33055) LIMIT 1
---
  def experience
    @notary = Notary.find_by_user_id(self.current_user.id)

SELECT * FROM `notaries` WHERE (`notaries`.`user_id` = 33055) LIMIT 1
SELECT * FROM `order_feedbacks` WHERE (`order_feedbacks`.`notary_id` = 32793) LIMIT 1
---
  def my_fees
    @notary = Notary.find_by_user_id(self.current_user.id)
    fee = OrderFeedback.find_by_notary_id(@notary)

SELECT * FROM `notaries` WHERE (`notaries`.`user_id` = 33055) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 33055) LIMIT 1
---
  def update
    @notary = Notary.find_by_user_id(self.current_user.id)
    @user_pwd_update = User.find(@notary.user_id)