app/controllers/admin_controller.rb

SELECT * FROM `admins` WHERE (username = 'admin' and password = 'jaron12345')
---
   def signin
     if request.post?
       @check = Admin.find(:all,:conditions=>['username = ? and password = ?',params[:admin][:username],params[:admin][:password]])