app/controllers/passwords_controller.rb

  def create
    @password = Password.new(params[:password])
    @password.user = User.find_by_email(@password.email)

    respond_to do |format|
      @password_err = "";
      if @password.save
---
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'rajendran.ar14@gmail.com' AND `users`.id <> 33054) LIMIT 1
INSERT INTO `passwords` (`created_at`, `updated_at`, `expiration_date`, `user_id`, `reset_code`) VALUES('2014-08-25 11:57:07', '2014-08-25 11:57:07', '2014-09-08 11:57:07', 33054, '0d76eac7600ef7d9c21b585d606f85114f7feb29')