app/controllers/sessions_controller.rb

UPDATE `users` SET `user_signin` = '2014-08-26 07:01:47', `updated_at` = '2014-08-26 07:01:48' WHERE `id` = 33055
---
  def create
    puts params.inspect
    logout_keeping_session!
    user = User.authenticate(params[:login], params[:password])
    if user
      # Protects against session fixation attacks, causes request forgery
      # protection if user resubmits an earlier form using back
      # button. Uncomment if you understand the tradeoffs.
      # reset_session
      self.current_user = user
      new_cookie_flag = (params[:remember_me] == "1")
      handle_remember_cookie! new_cookie_flag
      if user.user_type == "client" and user.suspend!=1

        redirect_back_or_default(:controller => "/client/orders", :action => "index")
        session[:password] = params[:password]
       user.user_signin = Time.now
       user.save